cesanta/mongoose/tutorials/stm32/nucleo-h723zg/cubemx/Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_flash_ex.c
      if (pCRCInit->TypeCRC == FLASH_CRC_SECTORS)
      {
        /* Clear sectors list */
        FLASH->CRCCR2 |= FLASH_CRCCR_CLEAN_SECT;

        /* Add CRC sectors */
        for(sector_index = pCRCInit->Sector; sector_index < (pCRCInit->NbSectors + pCRCInit->Sector); sector_index++)
        {
          FLASH_CRC_AddSector(sector_index, FLASH_BANK_2);
        }
      }
      else if (pCRCInit->TypeCRC == FLASH_CRC_BANK)
      {
        /* Enable Bank 2 CRC select bit */
        FLASH->CRCCR2 |= FLASH_CRCCR_ALL_BANK;
      }
      else
      {
        /* Select CRC start and end addresses */
        FLASH_CRC_SelectAddress(pCRCInit->CRCStartAddr, pCRCInit->CRCEndAddr, FLASH_BANK_2);
      }

      /* Start the CRC calculation */
      FLASH->CRCCR2 |= FLASH_CRCCR_START_CRC;

      /* Wait on CRC busy flag */
      status = FLASH_CRC_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE, FLASH_BANK_2);

      /* Return CRC result */
      (*CRC_Result) = FLASH->CRCDATA;

      /* Disable CRC feature */
      FLASH->CR2 &= (~FLASH_CR_CRC_EN);

      /* Clear CRC flags */
      __HAL_FLASH_CLEAR_FLAG_BANK2(FLASH_FLAG_CRCEND_BANK2 | FLASH_FLAG_CRCRDERR_BANK2);
    }
#endif /* DUAL_BANK */
  }

  return status;
}

/**
  * @}
  */

#if (USE_FLASH_ECC == 1U)
/** @defgroup FLASHEx_Exported_Functions_Group2 Extended ECC operation functions
  *  @brief   Extended ECC operation functions
  *
@verbatim
 ===============================================================================
                  ##### Extended ECC operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the Extended FLASH
    ECC Operations.

@endverbatim
  * @{
  */

/**
  * @brief  Enable ECC correction interrupts on FLASH BANK1 and BANK2.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_EnableEccCorrectionInterrupt(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_SNECCERR_BANK1);

#if defined (DUAL_BANK)
  __HAL_FLASH_ENABLE_IT(FLASH_IT_SNECCERR_BANK2);
#endif /* DUAL_BANK */
}

/**
  * @brief  Disable ECC correction interrupts on FLASH BANK1 and BANK2.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_DisableEccCorrectionInterrupt(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_SNECCERR_BANK1);

#if defined (DUAL_BANK)
  __HAL_FLASH_DISABLE_IT(FLASH_IT_SNECCERR_BANK2);
#endif /* DUAL_BANK */
}

/**
  * @brief  Enable ECC correction interrupt on FLASH BANK1.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_EnableEccCorrectionInterrupt_Bank1(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_SNECCERR_BANK1);
}

/**
  * @brief  Disable ECC correction interrupt on FLASH BANK1.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_DisableEccCorrectionInterrupt_Bank1(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_SNECCERR_BANK1);
}

#if defined (DUAL_BANK)
/**
  * @brief  Enable ECC correction interrupt on FLASH BANK2.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_EnableEccCorrectionInterrupt_Bank2(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_SNECCERR_BANK2);
}

/**
  * @brief  Disable ECC correction interrupt on FLASH BANK2.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_DisableEccCorrectionInterrupt_Bank2(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_SNECCERR_BANK2);
}
#endif /* DUAL_BANK */

/**
  * @brief  Enable ECC Detection interrupts on FLASH BANK1 and BANK2.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_EnableEccDetectionInterrupt(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_DBECCERR_BANK1);

#if defined (DUAL_BANK)
  __HAL_FLASH_ENABLE_IT(FLASH_IT_DBECCERR_BANK2);
#endif /* DUAL_BANK */
}

/**
  * @brief  Disable ECC Detection interrupts on FLASH BANK1 and BANK2.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_DisableEccDetectionInterrupt(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_DBECCERR_BANK1);

#if defined (DUAL_BANK)
  __HAL_FLASH_DISABLE_IT(FLASH_IT_DBECCERR_BANK2);
#endif /* DUAL_BANK */
}

/**
  * @brief  Enable ECC Detection interrupt on FLASH BANK1.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_EnableEccDetectionInterrupt_Bank1(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_DBECCERR_BANK1);
}

/**
  * @brief  Disable ECC correction interrupt on FLASH BANK1.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_DisableEccDetectionInterrupt_Bank1(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_DBECCERR_BANK1);
}

#if defined (DUAL_BANK)
/**
  * @brief  Enable ECC Detection interrupt on FLASH BANK2.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_EnableEccDetectionInterrupt_Bank2(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_DBECCERR_BANK2);
}

/**
  * @brief  Disable ECC Detection interrupt on FLASH BANK2.
  * @param  None
  * @retval None
  */
void HAL_FLASHEx_DisableEccDetectionInterrupt_Bank2(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_DBECCERR_BANK2);
}
#endif /* DUAL_BANK */

/**
  * @brief  Get the ECC error information.
  * @param  pData Pointer to an FLASH_EccInfoTypeDef structure that contains the
  *         ECC error information.
  * @note   This function should be called before ECC bit is cleared
  *         (in callback function)
  * @retval None
  */
void HAL_FLASHEx_GetEccInfo(FLASH_EccInfoTypeDef *pData)
{
  uint32_t errorflag;

  /* Check FLASH Bank1 ECC single correction and double detection error flags */
  errorflag = FLASH->SR1 & (FLASH_FLAG_SNECCERR_BANK1 | FLASH_FLAG_DBECCERR_BANK1);
  if(errorflag != 0U)
  {
    pData->Area = FLASH_ECC_AREA_USER_BANK1;
    pData->Address = ((((FLASH->ECC_FA1 & FLASH_ECC_FA_FAIL_ECC_ADDR))* FLASH_NB_32BITWORD_IN_FLASHWORD * 4) + FLASH_BANK1_BASE);
  }
#if defined (DUAL_BANK)
  /* Check FLASH Bank2 ECC single correction and double detection error flags */
  errorflag = FLASH->SR2 & (FLASH_FLAG_SNECCERR_BANK2 | FLASH_FLAG_DBECCERR_BANK2);
  if(errorflag != 0U)
  {
    pData->Area = FLASH_ECC_AREA_USER_BANK2;
    pData->Address = ((((FLASH->ECC_FA2 & FLASH_ECC_FA_FAIL_ECC_ADDR))* FLASH_NB_32BITWORD_IN_FLASHWORD * 4) + FLASH_BANK2_BASE);
  }
#endif /* DUAL_BANK */
}

/**
  * @brief Handle Flash ECC Detection interrupt request.
  * @retval None
  */
void HAL_FLASHEx_BusFault_IRQHandler(void)
{
  /* Check if the ECC double error occurred*/
  if ((FLASH->SR1 & FLASH_FLAG_DBECCERR_BANK1)  != 0)
  {
    /* FLASH ECC detection user callback */
    HAL_FLASHEx_EccDetectionCallback();

